Attribute VB_Name = "EnumColor"
Option Explicit

'列挙型カラーインデックス定数
Enum ci
  黒 = 1
  茶 = 53
  オリーブ = 52
  濃い緑 = 51
  濃い青緑 = 49
  濃い青 = 11
  インディゴ = 55
  灰色80 = 56
  濃い赤 = 9
  オレンジ = 46
  濃い黄 = 12
  緑 = 10
  青緑 = 14
  青 = 5
  ブルーグレー = 47
  灰色50 = 16
  赤 = 3
  薄いオレンジ = 45
  ライム = 43
  シーグリーン = 50
  アクア = 42
  薄い青 = 41
  紫 = 13
  灰色40 = 48
  ピンク = 7
  ゴールド = 44
  黄 = 6
  明るい緑 = 4
  水色 = 8
  スカイブルー = 33
  プラム = 54
  灰色25 = 15
  ローズ = 38
  ベージュ = 40
  薄い黄 = 36
  薄い緑 = 35
  薄い水色 = 34
  ペールブルー = 37
  ラベンダー = 39
  白 = 2

  'グラフ用カラーインデックス
  Gグレー = 17
  Gプラム = 18
  Gアイボリー = 19
  G薄い水色 = 20
  G濃い紫 = 21
  Gコーラル = 22
  Gオーシャンブルー = 23
  Gアイスブルー = 24
  G濃い青 = 25
  Gピンク = 26
  G黄 = 27
  G水色 = 28
  G紫 = 29
  G濃い赤 = 30
  G青緑 = 31
  G青 = 32
End Enum
